In [1]:
import pandas as pd
import numpy as np

df = pd.DataFrame({'sex' : ['M', 'F', np.nan, 'M', 'F'],
                    'score' : [5, 4, 3, 4, np.nan]})

df

   sex  score
0    M    5.0
1    F    4.0
2  NaN    3.0
3    M    4.0
4    F    NaN

In [2]:
df['score'] + 1

0    6.0
1    5.0
2    4.0
3    5.0
4    NaN
Name: score, dtype: float64

In [4]:
pd.isna(df)

     sex  score
0  False  False
1  False  False
2   True  False
3  False  False
4  False   True

In [5]:
pd.isna(df).sum()

sex      1
score    1
dtype: int64

In [6]:
df.dropna(subset = ['score'])

   sex  score
0    M    5.0
1    F    4.0
2  NaN    3.0
3    M    4.0

In [7]:
df.dropna(subset = ['sex', 'score'])

  sex  score
0   M    5.0
1   F    4.0
3   M    4.0

In [8]:
df

   sex  score
0    M    5.0
1    F    4.0
2  NaN    3.0
3    M    4.0
4    F    NaN

In [9]:
df.dropna()

  sex  score
0   M    5.0
1   F    4.0
3   M    4.0